// ДЗ.1. Есть массив [-10, 50, 60, 0, -100, 125]. Вывести в консоль только положительные+ числа.

let nums = [-10, 50, 60, 0, -100, 125,]
for(let i = 0; i < nums.length; i++) {
if (nums[i]>0) {
    console.log(nums[i])
}
}
// ______________________________________________________________________________________________

// ДЗ.2. Есть массив [11, 12, 15, 17, 18, 25, 26]. Вывести в консоль только четные числа. % - вычислить остаток от деления. 10 % 2 = 0. 11 % 2 = 1

let nums = [11, 12, 15, 17, 18, 25, 26]
for(let i = 0; i < nums.length; i++) {
    if(nums[i] %2 == 0) {
        console.log(nums[i])
    }
}

// ______________________________________________________________________________________________

// ДЗ.3  Есть массив [10, 20, 30 ,40 , 50, 60]. Найти сумму чисел в массиве и вывести их в консоль.let sum =  sum + arr[i]

var arr = [10, 20, 30 ,40 , 50, 60];
function arraySum(array){
var sum = 0;
for(var i = 0; i < array.length; i++){
    sum += array[i];
    }
console.log(sum);
}
arraySum(arr);
// ______________________________________________________________________________________________

// ДЗ.4. Есть массив [-10, 50, 60, 0, -100, 125]. Найти произведение отрицательных чисел

let result = 1
let nums = [-10, 50, 60, 0, -100, 125]
for(let i = 0; i < nums.length; i++) {
    if(nums[i] < 0){
        result = result * nums[i]
      
    }
   
}
console.log(result)
// _______________________________________________________________________________________________

/* ДЗ.5
    Запросить 10 чисел. 
    let num1 = +prompt("enter num 1")
    let num2 = +prompt("enter num 2")
    let num3 = +prompt("enter num 3")

    let nums = [100, 500] // 700, 1000, 500 --> [100, 500, 700, 1000, 500]
    nums.push(num1, num2, num3)
    console.log(nums);
*/

let nums = [100, 500]
for( let i = 0; i <= 10; i++){
    let num = +prompt("Enter number")
    nums.push(num)
}
console.log(nums)
// _______________________________________________________________________________________________